Autodesk.Revit.DB.FabricationConfiguration.GetItemFoldersUsedByServices(System.Collections.Generic.IList{System.Int32})
Gets a list of every fabrication item folder used by services.
serviceIds:
list of service ids to check.
Returns:
Returns a list of every fabrication item folder used by services.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.UnloadServicesAndItemFiles(System.Collections.Generic.IList{System.Int32},System.Collections.Generic.IList{System.String})
Unload the specific fabrication service from project.
serviceIds:
The ids of the fabrication services to unload.
itemFiles:
The relative filenames of the fabrication item files to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication item files can not be unloaded if they are in use currently.
-or-
Some item files have not been loaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.SetServicesToLoad(System.Collections.Generic.IList{System.Int32})
Sets the services which are to be loaded or not next time reloadConfiguration is called. If a service is not included but is currently loaded then it will be unloaded then.
Returns:
Returns true if successful. May fail if any service currently loaded is not included and is in use so cannot be unloaded.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.UnloadServices(System.Collections.Generic.IList{System.Int32})
Unload the specified fabrication services from the project.
serviceIds:
The ids of the fabrication services to unload.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Fabrication services can not be unloaded if they are in use currently.
-or-
Some services are not loaded yet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.LoadServices(System.Collections.Generic.IList{System.Int32})
Loads the specified fabrication services into the project.
serviceIds:
The ids of the fabrication services to load.
Returns:
The ids of the fabrication services which failed to load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The current fabrication configuration is not connected and updated to source configuration. Reload and try again.
-or-
this operation failed.
Since:
2016

Autodesk.Revit.DB.FabricationConfiguration.GetFabricationConfiguration(Autodesk.Revit.DB.Document)
Gets the fabrication configuration element in the document.
doc:
The document.
Returns:
The fabrication configuration element in the document.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2016